---
kind: method
id: M:Autodesk.Revit.DB.FillGrid.CalculateStrokesPerArea
source: html/04cccb85-770f-978b-3c4f-6aa5a1388fab.htm
---
# Autodesk.Revit.DB.FillGrid.CalculateStrokesPerArea Method

Calculates the number of the segments of the pattern per unit area.

## Syntax (C#)
```csharp
public double CalculateStrokesPerArea()
```

## Returns
The strokes per area.